{
  "Historical Perspective": "It was founded by the former President of Pakistan, Ghulam Ishaq Khan, in 1993. Since its establishment, the institute has consistently attracted the country's most influential scientists. GIKI is known to be a competitive institution with a low acceptance rate requiring students to show extraordinary academic excellence and capabilities with strong financial footing to be accommodated.",
  "Established/Charter": "1993",
  "University Charter": "GIK Institute helps you to discover and refine your abilities, guides you through new obstacles, and encourages you to help others along their journey. With a supportive community and ample opportunities to get involved, GIK Institute is the perfect place to pursue your passions and achieve your goals.",
  "Vision": "The GIK Institute seeks to play an inspiring role in imparting high-quality education and research in the fields of engineering, sciences, emerging technologies, and other disciplines.",
  "Mission Statement": "The Institute is to provide an excellent teaching and research environment to produce graduates who distinguish themselves by their professional competence, research, entrepreneurship, humanistic outlook, ethical rectitude, pragmatic approach to problem-solving, managerial skills, and ability to respond to the challenge of socio-economic development to serve as the vanguard of techno-industrial transformation of society.",
  "Research and Discovery": "The aim of the Institute is to pursue excellence in education and research by developing appropriate curricula and teaching practices, acquiring talented faculty, and providing an environment conducive to teaching and learning. Its graduates are expected to possess high professional competence combined with the humanistic and moral values envisaged in its profile of the Graduates.",
  "Teaching and Learning": "GIK Institute secures a Top position in SDG 4 Quality Education in Times Higher Education Impact Rankings 2022 in Pakistan and 37th Globally.",
  "Outreach and Public Service": "GIK Institute understands the value of partnerships and always looks ahead to form relationships with regional, national, and international organizations in the public, private, and not-for-profit sectors.",
  "International Linkages": "Leading national and international companies attended the GIKI Career Fair 2024.",
  "Why this University?": "GIKI is renowned for its commitment to academic excellence, attracting the brightest minds in the country. The institute provides a dynamic and innovative learning environment that fosters creativity and critical thinking. GIKI's strong connections with leading national and international companies create abundant opportunities for internships, research collaborations, and employment. GIK Institute is globally recognized, securing a top position in international rankings for quality education and research. With a supportive community and a commitment to holistic development, GIKI encourages students to pursue their passions and achieve their goals.",
  "Additional Details": "Over the years the reputation of the GIKI Institute of Engineering Sciences and Technology has been built on the quality of its faculty, students and the facilities, particularly the laboratories."
}
